# Bot Settings

bot_token = 'BOT TOKEN'

admin_id = 6666


# Links

"""
Используются для создания сообщения о принятии заявки.

--> [ welcome_text ]

Находится в конфиге, ниже.

"""

chat_join_link = ""  # ссылка на вступление в чат

main_bot_link = ""  # ссылка на основного бота в "ворк панелью"

info_channel_link = ""  # ссылка на новостной канал


# Bot Texts

start_message_text = '⭐️Добро пожаловать⭐️\n\n' \
                    '💫Прием заявок в GitHub Team💫\n\n' \
                    '✅Подавай заявку✅'


first_question_text = "Ответьте на несколько вопросов:\n\n" \
                      "1) Откуда узнали о нас?"


second_question_text = "2) Сколько времени готовы уделять работе?"


thrid_question = "3) Был ли у вас опыт в похожем проекте?"


last_step_text = "Ответы на наши вопросы:\n\n {}"


complite_text = "Заявка отправлена, ожидайте."


admin_req_text = "Новая заявка:\n\nusername: @{}\nID: {}\n\n{}"


admin_confirm_text = "Пользователь был успешно принят."


cancle_user_text = "Ваша заявка была отклонена."


welcome_text = "Поздравляю, вы приняты в нашу команду ✅\n\n" \
               "🔖 Ссылка для вступления в чат: {}\n\n" \
               "🔖 Ссылка для вступления в бота с ворк панелью: {}\n\n" \
               "🔖 Ссылка для вступления в канал с инфой: {}\n\n" \
               "❗️ ЧИТАЙТЕ ВСЕ МАНУАЛЫ В ЗАКРЕПЕ ❗️"


# Buttons text

request_btm_text = "Подать заявку"


complite_btm_text = "Отправить"


cancle_btm_text = "Заполнить заново"


# Admin Buttons Text

confirm_user_btm = "Принять"

cancle_user_btm = "Отклонить"